var MongoClient = require('mongodb').MongoClient;
var jalaali = require('jalaali-js');

mongoUrl = 'mongodb://filterbo_database:11111aaaaa@filterbourse.ir:27017/filterbo_database';

bd = 0;
cth = 0;
idp = 0;
pch = 0;
cl = 0;
mi = 0;
pt = 0;

earketInitError = 1;
marketInitDone = 0;
pClosingError = 1;
pClosingDone = 0;
allRowsBuffer = [];
clientTypeAllDone = 0;

function sleep(ms) {
	return new Promise(resolve => setTimeout(resolve, ms));
}

main();
async function main() {
	await ConnectToDB();
	await InitDbAndAllRows(dbo);
	//await dbo.createCollection('allRows', async (err, res) => {});

	process.argv.forEach(function(val, index, array) {
		if (val == 'all') {
			bd = 1;
			cth = 1;
			idp = 1;
			pch = 1;
			mi = 1;
		}

		if (val == 'bd') {
			bd = 1;
			console.log('bd = ', bd);
		}

		if (val == 'cth') {
			cth = 1;
		}
		if (val == 'idp') {
			idp = 1;
		}
		if (val == 'pch') {
			pch = 1;
		}
		if (val == 'cl') {
			cl = 1;
		}
		if (val == 'mi') {
			mi = 1;
		}
		if (val == 'pt') {
			pt = 1;
		}
	});

	let id = 1;
	for (i = 0; i < 1e10; i++) {
		console.log('round = ', i);

		if (pt == 1) {
			GetParTree();
		}

		if (bd == 1) {
			await GetBody(dbo, id);
			bodyCalls.forEach(v => {
				if (v) v.cancel();
			});
			console.log('bodyDone');
		}

		if (mi == 1 && clientTypeAllDone == 0) {
			await GetMarketInit(dbo, id);
			await GetClientTypeAll(dbo, id);
		}

		if (pch == 1) {
			await GetPClosingHist(dbo, id, 1); //adj
			pClosingHistCalls.forEach(v => {
				if (v) v.cancel();
			});

			await GetPClosingHist(dbo, id, 0); //not adj
			pClosingHistCalls.forEach(v => {
				if (v) v.cancel();
			});
			console.log('GetPClosingHistDone');
		}

		if (idp == 1) {
			await GetIntraDayPrice(dbo, id);
			intraDayPriceCalls.forEach(v => {
				if (v) v.cancel();
			});
			console.log('GetIntraDayPriceDone');
		}

		if (cth == 1) {
			await GetClientTypeHist(dbo, id);
			clientTypeHistCalls.forEach(v => {
				if (v) v.cancel();
			});
			console.log('GetClientTypeHistDone');
		}
		await sleep(2000);
		//GetShakesHa();
	}
	setTimeout(() => {
		try {
			client.close();
		} catch (e) {}
	}, 2000);
}

instAll = [
	{inscode: '38568786927478796', name: 'شیراز'},
	{inscode: '143187001116603', name: 'تملی612'},
	{inscode: '318005355896147', name: 'فسا'},
	{inscode: '350097973599097', name: 'تسه9705'},
	{inscode: '408934423224097', name: 'فرآور'},
	{inscode: '611986653700161', name: 'سبزوا'},
	{inscode: '675737110292645', name: 'فملی2'},
	{inscode: '685553375979058', name: 'اروند01'},
	{inscode: '778253364357513', name: 'وبملت'},
	{inscode: '793710053482057', name: 'لپیام'},
	{inscode: '831325835570803', name: 'ثنام'},
	{inscode: '881618880255065', name: 'شستا994'},
	{inscode: '898671485685327', name: 'ضفلا1136'},
	{inscode: '917857106093847', name: 'حپارسا'},
	{inscode: '1050751214677134', name: 'شگامرن'},
	{inscode: '1072964149653157', name: 'مترو9812'},
	{inscode: '1147221199852328', name: 'ضریز3000'},
	{inscode: '1200391996585610', name: 'تملی710'},
	{inscode: '1358190916156744', name: 'وآذر'},
	{inscode: '1601504922599756', name: 'ضترا2004'},
	{inscode: '1625149423498289', name: 'حسینا'},
	{inscode: '1723099959084685', name: 'رتکوح'},
	{inscode: '1745829084228393', name: 'رایان911'},
	{inscode: '1778142796834142', name: 'تملی803'},
	{inscode: '1822787329898392', name: 'کلر'},
	{inscode: '1831214548277647', name: 'تسه9803'},
	{inscode: '2121092235841480', name: 'وملل2'},
	{inscode: '2147129961448440', name: 'تملی712'},
	{inscode: '2254054929817435', name: 'غدام'},
	{inscode: '2318736941376687', name: 'خصدرا'},
	{inscode: '2328862017676109', name: 'وسپه'},
	{inscode: '2434703913394836', name: 'غدشت'},
	{inscode: '2589887561569709', name: 'خزامیا'},
	{inscode: '2849875720026255', name: 'صایپا112'},
	{inscode: '2888358730233310', name: 'اجاد23'},
	{inscode: '2929948497881810', name: 'اجاد25'},
	{inscode: '2944500421562364', name: 'وتوصا'},
	{inscode: '3050342257199174', name: 'قنقش'},
	{inscode: '3149396562827132', name: 'وایران'},
	{inscode: '3173544097113770', name: 'شستان'},
	{inscode: '3176699243034971', name: 'مکرج112'},
	{inscode: '3329167699100936', name: 'فنابا'},
	{inscode: '3453027360500664', name: 'شستا003'},
	{inscode: '3492952121304423', name: 'غدیس'},
	{inscode: '3493306453706327', name: 'شوینده'},
	{inscode: '3543463040833413', name: 'ضمخا7032'},
	{inscode: '3623921205367364', name: 'کدما'},
	{inscode: '3654864906585643', name: 'تکنو'},
	{inscode: '3722699128879020', name: 'حتاید'},
	{inscode: '3823243780502959', name: 'رتکو'},
	{inscode: '3826561665587230', name: 'تملی706'},
	{inscode: '3863538898378476', name: 'ثمسکن'},
	{inscode: '4146533087427956', name: 'صایپا908'},
	{inscode: '4159532151694984', name: 'فبستم'},
	{inscode: '4222940553343735', name: 'ضملت1119'},
	{inscode: '4247709727327181', name: 'مفاخر'},
	{inscode: '4338173689017034', name: 'قرن99'},
	{inscode: '4384288570322406', name: 'دلر'},
	{inscode: '4412822248968605', name: 'ضغدر8021'},
	{inscode: '4434125509381536', name: 'ضخوز3010'},
	{inscode: '4470657233334072', name: 'سخاش'},
	{inscode: '4507558419857064', name: 'زماهان'},
	{inscode: '4528607775462304', name: 'سفانو'},
	{inscode: '4563413583000719', name: 'ساراب'},
	{inscode: '4614779520007780', name: 'کسرا'},
	{inscode: '4659957480182399', name: 'اجاد21'},
	{inscode: '4686607974846832', name: 'سفارود'},
	{inscode: '4733285133017464', name: 'فخاس'},
	{inscode: '4758266259250794', name: 'خپویش'},
	{inscode: '4942127026063388', name: 'کاما'},
	{inscode: '5054819322815158', name: 'زمگسا'},
	{inscode: '5061777912819723', name: 'ضمخا7035'},
	{inscode: '5126621656875241', name: 'اخزا722'},
	{inscode: '5128151910501174', name: 'وحافظ'},
	{inscode: '5187018329202415', name: 'لپارس'},
	{inscode: '5203880991539408', name: 'اخزا807'},
	{inscode: '5305844922895340', name: 'داوه'},
	{inscode: '5317427172344706', name: 'هجرت'},
	{inscode: '5427792638736934', name: 'زفکا'},
	{inscode: '5516102131364383', name: 'غمینو'},
	{inscode: '5547896159175454', name: 'اخزا812'},
	{inscode: '5564768007356822', name: 'حریل'},
	{inscode: '5657981336716226', name: 'تسه9802'},
	{inscode: '5752911028185578', name: 'مشهد0112'},
	{inscode: '5816763371299689', name: 'ضجار3001'},
	{inscode: '5866848234665627', name: 'دسبحان'},
	{inscode: '6043384171800349', name: 'ثشرق'},
	{inscode: '6110133418282108', name: 'پارس'},
	{inscode: '6131290133202745', name: 'غمهرا'},
	{inscode: '6183017539978894', name: 'سکه0012پ01'},
	{inscode: '6303151084068271', name: 'ضخود3042'},
	{inscode: '6433335428452486', name: 'خعمرا'},
	{inscode: '6478064539164167', name: 'ریشمک'},
	{inscode: '6506179926371994', name: 'آریان'},
	{inscode: '6710089299473179', name: 'تسه9805'},
	{inscode: '6757220448540984', name: 'سشمال'},
	{inscode: '6847536925606808', name: 'ومعلم'},
	{inscode: '6951212170412722', name: 'شستا002'},
	{inscode: '6975987075611442', name: 'ضبدر2029'},
	{inscode: '7183333492448248', name: 'وپخش'},
	{inscode: '7235435095059069', name: 'پکویر'},
	{inscode: '7300125658580126', name: 'زکشت'},
	{inscode: '7385624172574740', name: 'ورنا'},
	{inscode: '7395271748414592', name: 'وخارزم'},
	{inscode: '7407628350690073', name: 'ضفلا8056'},
	{inscode: '7457232989848872', name: 'خمحور'},
	{inscode: '7459984729700117', name: 'مصفها203'},
	{inscode: '7483280423474368', name: 'خاهن'},
	{inscode: '7503669593172728', name: 'ثاصفا'},
	{inscode: '7505990056227818', name: 'ممسنی'},
	{inscode: '7628308021169118', name: 'بکهنوج'},
	{inscode: '7648513176877114', name: 'ضمعا3013'},
	{inscode: '7666290855904557', name: 'اخزا802'},
	{inscode: '7711282667602555', name: 'شاراک'},
	{inscode: '7715968593254705', name: 'شرق1400'},
	{inscode: '7745894403636165', name: 'شپنا'},
	{inscode: '7769065543658313', name: 'توسعه'},
	{inscode: '7902182071079987', name: 'اشاد1'},
	{inscode: '7907432614475432', name: 'ارمغان2'},
	{inscode: '7920014658832193', name: 'وگردش'},
	{inscode: '7938904494569702', name: 'ماهان99'},
	{inscode: '8058238145558609', name: 'زعف9908پ10'},
	{inscode: '8090875846286990', name: 'ضملی1135'},
	{inscode: '8139873208095439', name: 'ضجار3007'},
	{inscode: '8147372778893085', name: 'ضملت2022'},
	{inscode: '8174243655864577', name: 'شستا992'},
	{inscode: '8300819169359763', name: 'مشهد0012'},
	{inscode: '8499362984471239', name: 'ضشنا7056'},
	{inscode: '8532017750167668', name: 'ضمخا3018'},
	{inscode: '8646067353086740', name: 'بالاس'},
	{inscode: '8915450910866216', name: 'دزهراوی'},
	{inscode: '8977369674477111', name: 'کطبس'},
	{inscode: '8977441217024425', name: 'فسپا'},
	{inscode: '8981227815720204', name: 'برکتح'},
	{inscode: '9159659478026359', name: 'ضمخا7041'},
	{inscode: '9211775239375291', name: 'ذوب'},
	{inscode: '9322644336320024', name: 'جشکر812'},
	{inscode: '9481703061634967', name: 'پارسیان'},
	{inscode: '9536587154100457', name: 'وپاسار'},
	{inscode: '9586715245691917', name: 'اخزا715'},
	{inscode: '9657290597210645', name: 'سکه9812-03'},
	{inscode: '9761381741308262', name: 'وشمال'},
	{inscode: '9987529074833218', name: 'آبین'},
	{inscode: '10024128313803797', name: 'زگلدشت'},
	{inscode: '10055255678920880', name: 'وملت'},
	{inscode: '10120557300120078', name: 'پسهند'},
	{inscode: '10145129193828624', name: 'نگین'},
	{inscode: '10209600627455855', name: 'مشهد112'},
	{inscode: '10339760823334065', name: 'لوتوس99'},
	{inscode: '10427474943853556', name: 'سکه9912پ04'},
	{inscode: '10568944722570445', name: 'سصفها'},
	{inscode: '10574526790623372', name: 'تسه9710'},
	{inscode: '10587984591234722', name: 'ضترا2006'},
	{inscode: '10621594498709431', name: 'ضپار2009'},
	{inscode: '10654052153538617', name: 'کابگن'},
	{inscode: '10795723506538053', name: 'فیروزا'},
	{inscode: '10831074117626896', name: 'قاروم'},
	{inscode: '11019264549255051', name: 'اشاد7'},
	{inscode: '11258722998911897', name: 'وسکاب'},
	{inscode: '11332953223903902', name: 'تسه9701'},
	{inscode: '11403770140000603', name: 'ولملت'},
	{inscode: '11427939669935844', name: 'اطلس'},
	{inscode: '11432067920374603', name: 'دسینا'},
	{inscode: '11555144562661058', name: 'ضفلا1143'},
	{inscode: '11560002870991149', name: 'وپسا'},
	{inscode: '11615434537014226', name: 'ضمخا3025'},
	{inscode: '11622051128546106', name: 'شپاکسا'},
	{inscode: '11773403764702778', name: 'وبیمه'},
	{inscode: '11918692018527792', name: 'ضگل2033'},
	{inscode: '11927496285559135', name: 'اروند10'},
	{inscode: '11964419322927535', name: 'سرود'},
	{inscode: '12041217376571987', name: 'خریختح'},
	{inscode: '12089903491411130', name: 'تسه9808'},
	{inscode: '12253012396870681', name: 'ضمخا7040'},
	{inscode: '12303918642491681', name: 'زنجان'},
	{inscode: '12329519546621752', name: 'چدن'},
	{inscode: '12329915567896606', name: 'چکاپا'},
	{inscode: '12387472624849835', name: 'داسوه'},
	{inscode: '12390706505809150', name: 'گوهر'},
	{inscode: '12604253450599769', name: 'ضملی1139'},
	{inscode: '12638840758449459', name: 'پخش'},
	{inscode: '12746730665870442', name: 'بهپاک'},
	{inscode: '12752224677923341', name: 'خریخت'},
	{inscode: '12777578088653944', name: 'وحکمت'},
	{inscode: '12874072841236826', name: 'فسازان'},
	{inscode: '12901875871456398', name: 'ولراز'},
	{inscode: '12965822877128721', name: 'ثقزوی'},
	{inscode: '13136433023149017', name: 'اشاد62'},
	{inscode: '13227300125161435', name: 'سصوفی'},
	{inscode: '13235547361447092', name: 'زاگرس'},
	{inscode: '13243992182070788', name: 'درهآور'},
	{inscode: '13281937213456378', name: 'حسیر'},
	{inscode: '13449911384452435', name: 'ضپنا3027'},
	{inscode: '13611044044646901', name: 'ملت'},
	{inscode: '13688910352288869', name: 'ضملت1116'},
	{inscode: '13891373690607361', name: 'سلامت6'},
	{inscode: '13937270451301973', name: 'وبشهر'},
	{inscode: '14073782708315535', name: 'شنفت'},
	{inscode: '14173495376592095', name: 'ضمخا7030'},
	{inscode: '14231831499205396', name: 'سنیر'},
	{inscode: '14246499353718425', name: 'زعف9908پ13'},
	{inscode: '14312030900097668', name: 'غگلپا'},
	{inscode: '14398278072324784', name: 'قهکمت'},
	{inscode: '14602532410168192', name: 'ضشنا3031'},
	{inscode: '14617104402836487', name: 'سیلام'},
	{inscode: '14798249266057986', name: 'اشاد6'},
	{inscode: '14800142337291217', name: 'فولای'},
	{inscode: '14957056743925737', name: 'خلنت'},
	{inscode: '14985138705106402', name: 'دتهران‌'},
	{inscode: '15039949673085566', name: 'پردیس'},
	{inscode: '15124889255100138', name: 'رویش'},
	{inscode: '15221664222769132', name: 'تسه9801'},
	{inscode: '15259343650667588', name: 'قزوین'},
	{inscode: '15324020389819964', name: 'ضفار2011'},
	{inscode: '15374483986949695', name: 'دهدشت'},
	{inscode: '15424938732223941', name: 'صشرق99'},
	{inscode: '15451317146134956', name: 'افق ملت'},
	{inscode: '15472396110662150', name: 'سکرما'},
	{inscode: '15521712617204216', name: 'سفارس'},
	{inscode: '15589565387552095', name: 'ضملت1117'},
	{inscode: '15726796686853780', name: 'ثعمرا'},
	{inscode: '15826229869421585', name: 'تمحرکه'},
	{inscode: '15890655003477913', name: 'اروند11'},
	{inscode: '15917865009187760', name: 'مادیرا'},
	{inscode: '15930821245168534', name: 'سکارون'},
	{inscode: '15949743338644220', name: 'ساروم'},
	{inscode: '16061291367706222', name: 'ضپیک3011'},
	{inscode: '16236181211342354', name: 'اجاد27'},
	{inscode: '16303324355390262', name: 'افاد1'},
	{inscode: '16315910303613772', name: 'خاور'},
	{inscode: '16369313804633525', name: 'حپترو'},
	{inscode: '16405556680571453', name: 'کخاک'},
	{inscode: '16410724132711490', name: 'غفارس'},
	{inscode: '16450303698254968', name: 'ضفلا8060'},
	{inscode: '16553062355259729', name: 'بمیلا'},
	{inscode: '16596558163548546', name: 'ضغدر1107'},
	{inscode: '16673205196919832', name: 'شفارا'},
	{inscode: '16693610252404739', name: 'ثالوند'},
	{inscode: '16722829326716163', name: 'پست9908-04'},
	{inscode: '16777570760181431', name: 'کازرو'},
	{inscode: '16959429956899455', name: 'شاملا'},
	{inscode: '17059960254855208', name: 'غبهنوش'},
	{inscode: '17269972595370241', name: 'وآتوس'},
	{inscode: '17330546482145553', name: 'خمهر'},
	{inscode: '17392781708705080', name: 'زعف9908پ09'},
	{inscode: '17443620722309939', name: 'ضپار2008'},
	{inscode: '17523897860435974', name: 'ضغدر8026'},
	{inscode: '17528249960294496', name: 'وتوسم'},
	{inscode: '17617474823279712', name: 'آ س پ'},
	{inscode: '17661113951261114', name: 'تملی711'},
	{inscode: '17665924678868883', name: 'ضخود3046'},
	{inscode: '17800036702302776', name: 'ثاخت'},
	{inscode: '17834623106317041', name: 'خنصیر'},
	{inscode: '17933573078185644', name: 'آینده'},
	{inscode: '17939384202383793', name: 'ثغرب'},
	{inscode: '17941426325664429', name: 'افاد4'},
	{inscode: '18004480270695404', name: 'فمراد'},
	{inscode: '18027801615184692', name: 'کچاد'},
	{inscode: '18063426072758458', name: 'وبهمن'},
	{inscode: '18067743398074470', name: 'اخزا716'},
	{inscode: '18093681647131179', name: 'دتولید'},
	{inscode: '18275313863657221', name: 'صایپا104'},
	{inscode: '18297628506482242', name: 'زعف9908پ08'},
	{inscode: '18303237082155264', name: 'دفرا'},
	{inscode: '18346219759153870', name: 'شصفها'},
	{inscode: '18401147983387689', name: 'غپینو'},
	{inscode: '18452085181471587', name: 'ضپنا3023'},
	{inscode: '18498346892784552', name: 'ضریز3005'},
	{inscode: '18568915061663137', name: 'اروند04'},
	{inscode: '18599703143458101', name: 'امید'},
	{inscode: '18683861709119246', name: 'سلامت1'},
	{inscode: '18822704361279128', name: 'اجاد422'},
	{inscode: '18883380772506226', name: 'ثرود'},
	{inscode: '18922528209619291', name: 'ضملی1128'},
	{inscode: '19024886606470752', name: 'اجاد42'},
	{inscode: '19040514831923530', name: 'نوری'},
	{inscode: '19257295292088310', name: 'خکمک'},
	{inscode: '19298748452450329', name: 'تایرا'},
	{inscode: '19310456400689867', name: 'خبازرس'},
	{inscode: '19345501999441412', name: 'زعف9908پ05'},
	{inscode: '19367527798307032', name: 'فالوم'},
	{inscode: '19422860143693289', name: 'تسه9806'},
	{inscode: '19471788163911687', name: 'کفپارس'},
	{inscode: '19839750988634567', name: 'وآفری'},
	{inscode: '19905430374943557', name: 'ضجار3002'},
	{inscode: '19950220183244479', name: 'ضبدر2028'},
	{inscode: '19954896371640204', name: 'وزمین'},
	{inscode: '20024911381434086', name: 'دکیمی'},
	{inscode: '20034264486679145', name: 'سجام'},
	{inscode: '20393717141867821', name: 'تسه9709'},
	{inscode: '20411759370751096', name: 'کنور'},
	{inscode: '20453828618330936', name: 'بنیرو'},
	{inscode: '20478235308214741', name: 'ضمعا3002'},
	{inscode: '20487994977117557', name: 'غشهد'},
	{inscode: '20525219137250173', name: 'ضچاد3013'},
	{inscode: '20562694899904339', name: 'شپدیس'},
	{inscode: '20865316761157979', name: 'فاراک'},
	{inscode: '20909901812271390', name: 'اخزا809'},
	{inscode: '20926459161497908', name: 'ثتران'},
	{inscode: '20946530370469828', name: 'ولیز'},
	{inscode: '20966291817819448', name: 'فسدید'},
	{inscode: '21166660564301770', name: 'شستا001'},
	{inscode: '21227813276368514', name: 'طجار3006'},
	{inscode: '21388492749900591', name: 'مشهد995'},
	{inscode: '21426277483799140', name: 'غنیلی'},
	{inscode: '21607242972640064', name: 'شغدیر'},
	{inscode: '22032666478119723', name: 'ضمعا3004'},
	{inscode: '22056192338521781', name: 'ضخود3039'},
	{inscode: '22086876724551482', name: 'بموتو'},
	{inscode: '22087269603540841', name: 'وپست'},
	{inscode: '22164355468450959', name: 'اشاد9'},
	{inscode: '22255783119783047', name: 'درازک'},
	{inscode: '22260326095996531', name: 'حتوکا'},
	{inscode: '22275596386264204', name: 'کوثر'},
	{inscode: '22308305646551497', name: 'تپولا'},
	{inscode: '22380773158602080', name: 'ضفلا8068'},
	{inscode: '22382156782768756', name: 'بکام'},
	{inscode: '22490169030401337', name: 'وآوا'},
	{inscode: '22560050433388046', name: 'تاپیکو'},
	{inscode: '22667016906590506', name: 'شبهرن'},
	{inscode: '22787503301679573', name: 'کروی'},
	{inscode: '22811176775480091', name: 'اخابر'},
	{inscode: '22839330962768817', name: 'آتیمس'},
	{inscode: '22903901709044823', name: 'ختراک'},
	{inscode: '22941065011246116', name: 'کپرور'},
	{inscode: '22950683624908253', name: 'نتوس'},
	{inscode: '22956708386610464', name: 'خودکفا'},
	{inscode: '22991966099258944', name: 'زیر9903پ02'},
	{inscode: '23049019886587905', name: 'خفولا'},
	{inscode: '23086515493897579', name: 'ولغدر'},
	{inscode: '23175320865252772', name: 'وسالت'},
	{inscode: '23214828924506640', name: 'پکرمان'},
	{inscode: '23293437377896568', name: 'تاصیکو'},
	{inscode: '23353689102956991', name: 'دکوثر'},
	{inscode: '23441366113375722', name: 'پارسان'},
	{inscode: '23458117616920867', name: 'سشمالح'},
	{inscode: '23581215918684761', name: 'اروند03'},
	{inscode: '23600798892801694', name: 'قچار'},
	{inscode: '23629218491321479', name: 'گندم24'},
	{inscode: '23695001747840020', name: 'اخزا709'},
	{inscode: '23791232955302467', name: 'سلامت4'},
	{inscode: '23837844039713715', name: 'کفرا'},
	{inscode: '23838634016123354', name: 'مرقام'},
	{inscode: '23891830829322971', name: 'بایکا'},
	{inscode: '23936607891892333', name: 'چافست'},
	{inscode: '24018878640527909', name: 'میدکو'},
	{inscode: '24079409192818584', name: 'پدرخش'},
	{inscode: '24085906177899789', name: 'کترام'},
	{inscode: '24212636157410845', name: 'وآرین'},
	{inscode: '24254843881948059', name: 'چکاوه'},
	{inscode: '24303422207378456', name: 'غالبر'},
	{inscode: '24644999329120295', name: 'وملل'},
	{inscode: '24651304184097917', name: 'تاصیکو2'},
	{inscode: '24662567615903665', name: 'وسنا'},
	{inscode: '24807173016704795', name: 'سباقر'},
	{inscode: '24832515281647747', name: 'شلرد02'},
	{inscode: '24869832924911721', name: 'آسامید'},
	{inscode: '25001509088465005', name: 'کساوه'},
	{inscode: '25056825342482421', name: 'ضشنا3033'},
	{inscode: '25167449580509543', name: 'اشاد102'},
	{inscode: '25180702353416009', name: 'زدشت'},
	{inscode: '25215182208950217', name: 'وهور'},
	{inscode: '25244329144808274', name: 'فارس'},
	{inscode: '25286509736208688', name: 'فلامی'},
	{inscode: '25357135030606405', name: 'تنوین'},
	{inscode: '25435625417909263', name: 'اخزا815'},
	{inscode: '25514780181345713', name: 'وساخت'},
	{inscode: '25631699615003698', name: 'کهرام'},
	{inscode: '25758309844190279', name: 'نوریل02'},
	{inscode: '26014913469567886', name: 'وغدیر'},
	{inscode: '26259366519412975', name: 'زشگزا'},
	{inscode: '26336598784230831', name: 'ضغدر1109'},
	{inscode: '26543014712914772', name: 'میهن'},
	{inscode: '26547785441834730', name: 'زشریف'},
	{inscode: '26622634572348721', name: 'تملی804'},
	{inscode: '26801342331998486', name: 'ضملی2043'},
	{inscode: '26824673819862694', name: 'خبهمن'},
	{inscode: '26927142986179586', name: 'اروند05'},
	{inscode: '26975313673310117', name: 'ضغدر1105'},
	{inscode: '26997316501080743', name: 'سشرق'},
	{inscode: '27000326841257664', name: 'سدشت'},
	{inscode: '27096851668435724', name: 'جم پیلن'},
	{inscode: '27148595522452496', name: 'صینا205'},
	{inscode: '27218386411183410', name: 'سدور'},
	{inscode: '27237407271391991', name: 'ضخوز3009'},
	{inscode: '27259484209117565', name: 'سلامت3'},
	{inscode: '27299841173245405', name: 'داراب'},
	{inscode: '27308217070238237', name: 'شکربن'},
	{inscode: '27338175838625962', name: 'شستا004'},
	{inscode: '27668158733246204', name: 'سپرمی'},
	{inscode: '27814844870305607', name: 'کیمیا'},
	{inscode: '27857905114371789', name: 'اخزا804'},
	{inscode: '27922860956133067', name: 'مبین'},
	{inscode: '27952969918967492', name: 'رکیش'},
	{inscode: '28025154952452710', name: 'صخود0004'},
	{inscode: '28230238564334914', name: 'قجام'},
	{inscode: '28233243878473697', name: 'ضمخا7039'},
	{inscode: '28251956446987982', name: 'شمواد'},
	{inscode: '28253678449273505', name: 'حخزر'},
	{inscode: '28320293733348826', name: 'وبصادر'},
	{inscode: '28325731560106431', name: 'کساپا'},
	{inscode: '28328710198554144', name: 'وبوعلی'},
	{inscode: '28431095903407567', name: 'کاسپین'},
	{inscode: '28450080638096732', name: 'سیمرغ'},
	{inscode: '28672095850798501', name: 'غسالم'},
	{inscode: '28788598290160782', name: 'الماس'},
	{inscode: '28809886765682162', name: 'حفاری'},
	{inscode: '28845264556937486', name: 'شپلی'},
	{inscode: '28854105556435129', name: 'ثزاگرس'},
	{inscode: '28864540805361867', name: 'فخوز'},
	{inscode: '29122854902865456', name: 'کسعدی'},
	{inscode: '29247915161590165', name: 'دلقما'},
	{inscode: '29296933544549590', name: 'اشاد94'},
	{inscode: '29316948750916349', name: 'پلوله'},
	{inscode: '29376430435711489', name: 'ضترا2009'},
	{inscode: '29390063753915950', name: 'ضگل2031'},
	{inscode: '29512568608949554', name: 'اخزا703'},
	{inscode: '29527985620948695', name: 'خکرمان'},
	{inscode: '29599448627202650', name: 'ضملت1115'},
	{inscode: '29758477602878557', name: 'تیپیکو'},
	{inscode: '29860265627578401', name: 'ما'},
	{inscode: '29882244560576007', name: 'بزاگرس'},
	{inscode: '29935695527853744', name: 'افاد51'},
	{inscode: '29974853866926823', name: 'فروی'},
	{inscode: '30231789123900526', name: 'نمرینو'},
	{inscode: '30282299500988269', name: 'آکورد'},
	{inscode: '30506910505599743', name: 'صایتل902'},
	{inscode: '30507152381699953', name: 'ثجوان'},
	{inscode: '30650426998863332', name: 'لبوتان'},
	{inscode: '30703140537034664', name: 'کگهر'},
	{inscode: '30719054967088301', name: 'تکمبا'},
	{inscode: '30765727085936322', name: 'فجام'},
	{inscode: '30812398063090552', name: 'ضپیک3010'},
	{inscode: '30812750556497648', name: 'ضبدر2027'},
	{inscode: '30829203706095076', name: 'ستران'},
	{inscode: '30852391633490755', name: 'ثفارس'},
	{inscode: '30956364372373569', name: 'طفلا1150'},
	{inscode: '30974710508383145', name: 'شسینا'},
	{inscode: '31024260997481994', name: 'غگرجی'},
	{inscode: '31049085025064185', name: 'شتهران'},
	{inscode: '31078457170311964', name: 'ولشرق'},
	{inscode: '31316784129157162', name: 'غصینو'},
	{inscode: '31366347648583654', name: 'ارمغان'},
	{inscode: '31476336486772840', name: 'ضملی1129'},
	{inscode: '31529399361341835', name: 'ضجار3009'},
	{inscode: '31791737198597563', name: 'غشان'},
	{inscode: '31879190587976736', name: 'خوساز'},
	{inscode: '31928933749228545', name: 'ضبدر2030'},
	{inscode: '32194839454720154', name: 'ضجار3006'},
	{inscode: '32328661463958626', name: 'ضترا2005'},
	{inscode: '32338211917133256', name: 'پاساح'},
	{inscode: '32357363984168442', name: 'جم'},
	{inscode: '32391119028236636', name: 'ضپنا3024'},
	{inscode: '32453604314166518', name: 'ضجار3004'},
	{inscode: '32525655729432562', name: 'سبهان'},
	{inscode: '32678431934327184', name: 'کلوند'},
	{inscode: '32821908911812078', name: 'خزر'},
	{inscode: '32845891587040106', name: 'ثنوسا'},
	{inscode: '32905574440152196', name: 'مشیر112'},
	{inscode: '32982652838367432', name: 'تملی704'},
	{inscode: '33254899395816171', name: 'زر'},
	{inscode: '33293588228706998', name: 'وپارس'},
	{inscode: '33343732576627331', name: 'انرژی1'},
	{inscode: '33406621820337161', name: 'دجابر'},
	{inscode: '33420285433308219', name: 'زپارس'},
	{inscode: '33512084144201783', name: 'مبین013'},
	{inscode: '33521509676474411', name: 'شستا005'},
	{inscode: '33541897671561960', name: 'واتی'},
	{inscode: '33603212156438463', name: 'دشیمی'},
	{inscode: '33611155027418901', name: 'غشهداب'},
	{inscode: '33629260529503413', name: 'بجهرم'},
	{inscode: '33683240001985963', name: 'شراز'},
	{inscode: '33736447482634583', name: 'غپونه'},
	{inscode: '33783140337377394', name: 'خچرخش'},
	{inscode: '33808206014018431', name: 'سمازن'},
	{inscode: '33854964748757477', name: 'رنیک'},
	{inscode: '33887145736684266', name: 'آگاس'},
	{inscode: '33889280063931972', name: 'اشاد10'},
	{inscode: '33931218652865616', name: 'ونفت'},
	{inscode: '34032872653290886', name: 'غپاک'},
	{inscode: '34144395039913458', name: 'عیار'},
	{inscode: '34303815391827420', name: 'ضغدر1106'},
	{inscode: '34540569618314880', name: 'قاسم'},
	{inscode: '34557241988629814', name: 'برکت'},
	{inscode: '34565348191664379', name: 'شستا993'},
	{inscode: '34603740310528516', name: 'ضملی1134'},
	{inscode: '34621618468546063', name: 'ولتجار'},
	{inscode: '34641719089573667', name: 'دتماد'},
	{inscode: '34673681828119297', name: 'فاما'},
	{inscode: '34718633636164421', name: 'کمند'},
	{inscode: '34721884030854211', name: 'سفاسی'},
	{inscode: '34743062472637188', name: 'اجاد41'},
	{inscode: '34776415527452961', name: 'تسه9704'},
	{inscode: '34890845654517313', name: 'ساربیل'},
	{inscode: '34958397778580226', name: 'ضغدر1108'},
	{inscode: '35154825591409553', name: 'زعف9908پ11'},
	{inscode: '35158826900216508', name: 'غاذر'},
	{inscode: '35178706978554988', name: 'شپاس'},
	{inscode: '35188369797280638', name: 'تسه9711'},
	{inscode: '35212872147350725', name: 'ضپار2003'},
	{inscode: '35366681030756042', name: 'شبندر'},
	{inscode: '35369183060321179', name: 'ومشان'},
	{inscode: '35424116338766901', name: 'حفارس'},
	{inscode: '35425587644337450', name: 'فملی'},
	{inscode: '35445515321658835', name: 'فماک'},
	{inscode: '35448830065044256', name: 'ضشنا3034'},
	{inscode: '35541297751844500', name: 'اخزا805'},
	{inscode: '35557019220393916', name: 'اشاد92'},
	{inscode: '35669480110084448', name: 'سپاها'},
	{inscode: '35700344742885862', name: 'کگل'},
	{inscode: '35714741066489959', name: 'ضفلا1146'},
	{inscode: '35796086458096255', name: 'شیران'},
	{inscode: '35948133957468680', name: 'سرچشمه'},
	{inscode: '35964395659427029', name: 'قشکر'},
	{inscode: '36043751160770114', name: 'ضملت1113'},
	{inscode: '36045669822709476', name: 'ضفلا1144'},
	{inscode: '36385738315834272', name: 'صایپا403'},
	{inscode: '36592972482259020', name: 'آسام'},
	{inscode: '36609406760796639', name: 'مبین012'},
	{inscode: '36671655475498480', name: 'قشرین'},
	{inscode: '36773155987365094', name: 'اعتلا'},
	{inscode: '36899214178084525', name: 'شفا'},
	{inscode: '36907311539363760', name: 'ضخوز3008'},
	{inscode: '36958631592317557', name: 'ضملت1100'},
	{inscode: '37114514127305200', name: 'بنو'},
	{inscode: '37148101999680137', name: 'حریل02'},
	{inscode: '37198734218751769', name: 'اخزا624'},
	{inscode: '37204371816016200', name: 'وصندوق'},
	{inscode: '37222720235819361', name: 'بذر'},
	{inscode: '37265372961114371', name: 'ضفلا1145'},
	{inscode: '37278604854336035', name: 'اشاد2'},
	{inscode: '37281199178613855', name: 'سیدکو'},
	{inscode: '37335595969902658', name: 'افاد2'},
	{inscode: '37389789764168256', name: 'توریل'},
	{inscode: '37614886280396031', name: 'وساپا'},
	{inscode: '37631109616997982', name: 'قشهد'},
	{inscode: '37842793167868642', name: 'غویتا'},
	{inscode: '37958857929299636', name: 'مبین015'},
	{inscode: '38066740861554557', name: 'تسه9706'},
	{inscode: '38084304113529336', name: 'خدیزل'},
	{inscode: '38166945723865485', name: 'تسه9708'},
	{inscode: '38179358042686391', name: 'سامان'},
	{inscode: '38436612777305077', name: 'تسه9807'},
	{inscode: '38437201078089290', name: 'کرماشا'},
	{inscode: '38555056423456635', name: 'شتوکا'},
	{inscode: '38608801348941191', name: 'ضغدر8027'},
	{inscode: '38731201002966653', name: 'طجار3009'},
	{inscode: '38738476064699383', name: 'آرمان'},
	{inscode: '38934209860227670', name: 'ضملت2021'},
	{inscode: '39116664428676213', name: 'شلعاب'},
	{inscode: '39171819040364290', name: 'انرژی3'},
	{inscode: '39258556256580392', name: 'اخزا801'},
	{inscode: '39436183727126211', name: 'خمحرکه'},
	{inscode: '39453972158399542', name: 'سپاس'},
	{inscode: '39481233087768672', name: 'نیرو'},
	{inscode: '39556321951488935', name: 'ضپیک3007'},
	{inscode: '39604494485558197', name: 'تسه9702'},
	{inscode: '39721109617818727', name: 'صگل411'},
	{inscode: '39751275523025334', name: 'اتکای'},
	{inscode: '39801771451196931', name: 'جوپار99'},
	{inscode: '39807886630843041', name: 'بمپنا'},
	{inscode: '40025799067544201', name: 'شرنگی'},
	{inscode: '40043919653526083', name: 'وثخوز'},
	{inscode: '40149463639215650', name: 'اخزا623'},
	{inscode: '40262275031537922', name: 'دروز'},
	{inscode: '40411537531154482', name: 'قصفها'},
	{inscode: '40483499097200406', name: 'ضترا2008'},
	{inscode: '40505767672724777', name: 'رانفور'},
	{inscode: '40601326015230157', name: 'صخابر102'},
	{inscode: '40611478183231802', name: 'شدوص'},
	{inscode: '40650252484299134', name: 'ثاژن'},
	{inscode: '40808043719554948', name: 'فولاژ'},
	{inscode: '40873181245119707', name: 'تبریز112'},
	{inscode: '41048299027409941', name: 'رتاپ'},
	{inscode: '41227201752535311', name: 'سفار'},
	{inscode: '41284516796232939', name: 'سهگمت'},
	{inscode: '41302553376174581', name: 'فجر'},
	{inscode: '41309167317349268', name: 'صفارس412'},
	{inscode: '41379697187196382', name: 'وشهر'},
	{inscode: '41625340598198551', name: 'بساما'},
	{inscode: '41713045190742691', name: 'وسدید'},
	{inscode: '41781090739318251', name: 'تلیسه'},
	{inscode: '41796741644273824', name: 'وملی'},
	{inscode: '41898828400781536', name: 'ضمعا3005'},
	{inscode: '41935584690956944', name: 'پتایر'},
	{inscode: '41974758296041288', name: 'سخوز'},
	{inscode: '42022764536820665', name: 'مشیر9911'},
	{inscode: '42031056662310763', name: 'اخزا723'},
	{inscode: '42049553761321495', name: 'کورز'},
	{inscode: '42075223783409640', name: 'خاذین'},
	{inscode: '42084263157016079', name: 'جشکر903'},
	{inscode: '42193633309719782', name: 'ضپار2006'},
	{inscode: '42354736493447489', name: 'خپارس'},
	{inscode: '42387718866026650', name: 'غبشهر'},
	{inscode: '42513436875973251', name: 'ضبدر2026'},
	{inscode: '42576718434222894', name: 'اخزا720'},
	{inscode: '42690477960659940', name: 'کشرق'},
	{inscode: '42696242981550091', name: 'کصدف'},
	{inscode: '43023243844297350', name: 'چنوپا'},
	{inscode: '43039599691270215', name: 'حکمت01'},
	{inscode: '43062880954780884', name: 'تپمپی'},
	{inscode: '43283802997035462', name: 'وسبحان'},
	{inscode: '43319345548600453', name: 'تملی802'},
	{inscode: '43342306308122676', name: 'قمرو'},
	{inscode: '43362635835198978', name: 'های وب'},
	{inscode: '43374709930371268', name: 'دحاوی'},
	{inscode: '43479730079120887', name: 'ضپنا3028'},
	{inscode: '43531447361624437', name: 'عیار2'},
	{inscode: '43545527030854340', name: 'کویر'},
	{inscode: '43622578471330344', name: 'دسبحا'},
	{inscode: '43627645917394386', name: 'مصفها112'},
	{inscode: '43716452378323683', name: 'فزرین'},
	{inscode: '43749359039031456', name: 'صبا1401'},
	{inscode: '43781018754867729', name: 'شفارس'},
	{inscode: '43801363961831435', name: 'مبین016'},
	{inscode: '43913530989262989', name: 'سمایه'},
	{inscode: '43951910415124966', name: 'وگستر'},
	{inscode: '43966385447049549', name: 'ودی'},
	{inscode: '43980443266547806', name: 'ضمخا7033'},
	{inscode: '44013656953678055', name: 'شرانل'},
	{inscode: '44052047028305231', name: 'پشاهن'},
	{inscode: '44153164692325703', name: 'شگل'},
	{inscode: '44296315953738727', name: 'فاهواز'},
	{inscode: '44549439964296944', name: 'کالا'},
	{inscode: '44625249840480397', name: 'حآسا'},
	{inscode: '44665761767777759', name: 'گکیش'},
	{inscode: '44802346787824971', name: 'ساروج'},
	{inscode: '44818950263583523', name: 'دی'},
	{inscode: '44850033148208596', name: 'غچین'},
	{inscode: '44891482026867833', name: 'خساپا'},
	{inscode: '44967158778304588', name: 'قثابت'},
	{inscode: '44973920892470189', name: 'طمخا7032'},
	{inscode: '44986797317463049', name: 'وثنو'},
	{inscode: '45042869458982253', name: 'افاد52'},
	{inscode: '45050389997905274', name: 'وسینا'},
	{inscode: '45062188442385800', name: 'تفیرو'},
	{inscode: '45066064863062755', name: 'ثنظام'},
	{inscode: '45174198424472334', name: 'ولساپا'},
	{inscode: '45205530868811305', name: 'صایند'},
	{inscode: '45353549301778828', name: 'اخزا816'},
	{inscode: '45452485689363029', name: 'بخاور'},
	{inscode: '45518744711972166', name: 'غپآذر'},
	{inscode: '45599117419300570', name: 'ضمعا3011'},
	{inscode: '45608932669358493', name: 'کایتا'},
	{inscode: '45641540066710190', name: 'لکما'},
	{inscode: '45728383369147894', name: 'امین یکم'},
	{inscode: '45747858932368314', name: 'اخزا808'},
	{inscode: '45895339414786358', name: 'خرینگ'},
	{inscode: '46178280540110577', name: 'بفجر'},
	{inscode: '46287096702853935', name: 'زیر9903پ03'},
	{inscode: '46348559193224090', name: 'فولاد'},
	{inscode: '46435139220938109', name: 'کرانه99'},
	{inscode: '46700660505281786', name: 'طلا'},
	{inscode: '46741025610365786', name: 'سمگا'},
	{inscode: '46752599569017089', name: 'بترانس'},
	{inscode: '46772701938567445', name: 'اتکام'},
	{inscode: '46773487536596471', name: 'اخزا721'},
	{inscode: '46830341954511303', name: 'وآیند'},
	{inscode: '46935770769996713', name: 'ضغدر2008'},
	{inscode: '46943948516191236', name: 'ضملت2023'},
	{inscode: '46982154647719707', name: 'وصنا'},
	{inscode: '46988708892096925', name: 'ضملت1114'},
	{inscode: '47101579271117172', name: 'دمعیار'},
	{inscode: '47232550823972469', name: 'وتوکا'},
	{inscode: '47302318535715632', name: 'ونوین'},
	{inscode: '47333458678352378', name: 'وخاور'},
	{inscode: '47348197320716810', name: 'دسانکو'},
	{inscode: '47377315952751604', name: 'بسویچ'},
	{inscode: '47663391792649083', name: 'ضپیک3012'},
	{inscode: '47702059190622416', name: 'ثتوسا'},
	{inscode: '47749661205825616', name: 'سیستم'},
	{inscode: '47841327496247362', name: 'واعتبار'},
	{inscode: '47996917271187218', name: 'وکار'},
	{inscode: '48004464435679262', name: 'عسناسنگ'},
	{inscode: '48010225447410247', name: 'وبانک'},
	{inscode: '48018896135442083', name: 'ضفلا8067'},
	{inscode: '48043180063638654', name: 'تملی709'},
	{inscode: '48102697378515196', name: 'صایپا412'},
	{inscode: '48287670503317419', name: 'ولبهمن'},
	{inscode: '48338606859106961', name: 'تسه9612'},
	{inscode: '48456605452591386', name: 'اجاد22'},
	{inscode: '48460161182549846', name: 'صمسکن912'},
	{inscode: '48511238766369097', name: 'دانا'},
	{inscode: '48623320733330408', name: 'فلوله'},
	{inscode: '48702596863145683', name: 'آگاس2'},
	{inscode: '48731351079431981', name: 'سلامت5'},
	{inscode: '48753732042176709', name: 'شبریز'},
	{inscode: '48762046694019828', name: 'صخود1412'},
	{inscode: '48894640746904953', name: 'کلر4'},
	{inscode: '48990026850202503', name: 'خگستر'},
	{inscode: '48993230008229282', name: 'سیلامح'},
	{inscode: '49040900499589053', name: 'اجاد3'},
	{inscode: '49054891736433700', name: 'دعبید'},
	{inscode: '49098888060352140', name: 'ضبدر2025'},
	{inscode: '49100528005631270', name: 'ضبدر2024'},
	{inscode: '49129081625829210', name: 'نشار'},
	{inscode: '49188729526980541', name: 'شسپا'},
	{inscode: '49208227309752531', name: 'ضجار3003'},
	{inscode: '49244604018250364', name: 'شجم'},
	{inscode: '49308939155775654', name: 'ضملی2044'},
	{inscode: '49353447565507376', name: 'کاذر'},
	{inscode: '49399017998386087', name: 'فبیرا'},
	{inscode: '49502666250908008', name: 'افق'},
	{inscode: '49507346707445426', name: 'اجاد26'},
	{inscode: '49627523909849331', name: 'کفرآور'},
	{inscode: '49674915481184052', name: 'جهرم'},
	{inscode: '49953653111442595', name: 'کیسون'},
	{inscode: '50002340308486819', name: 'تاپکیش'},
	{inscode: '50100062518826135', name: 'دامین'},
	{inscode: '50117925085549635', name: 'خلیبل'},
	{inscode: '50185721305191887', name: 'ختور'},
	{inscode: '50235687797910703', name: 'سلامت2'},
	{inscode: '50341528161302545', name: 'کمنگنز'},
	{inscode: '50368344235826302', name: 'لازما'},
	{inscode: '50547667960799833', name: 'ضخود3041'},
	{inscode: '50580753680043015', name: 'معیار '},
	{inscode: '50633804639547462', name: 'کمرجان'},
	{inscode: '50640145835946281', name: 'ضمخا7034'},
	{inscode: '50652985928800943', name: 'غیوان'},
	{inscode: '50659224705136694', name: 'زعف9908پ15'},
	{inscode: '50792786683910016', name: 'کرمان'},
	{inscode: '51106317433079213', name: 'آسیا'},
	{inscode: '51199734387556694', name: 'هشسپا903'},
	{inscode: '51294484197536070', name: 'غشوکو'},
	{inscode: '51443230896454947', name: 'اروند02'},
	{inscode: '51459202425114449', name: 'تابا'},
	{inscode: '51617145873056483', name: 'شتران'},
	{inscode: '51716260276805622', name: 'جاتو812'},
	{inscode: '51913505522928208', name: 'ضمخا7025'},
	{inscode: '51971068201094874', name: 'بپاس'},
	{inscode: '52011547716040734', name: 'تسه9809'},
	{inscode: '52220424531578944', name: 'سغرب'},
	{inscode: '52232388263291380', name: 'وامید'},
	{inscode: '52365266148848270', name: 'صخود412'},
	{inscode: '52382684379473036', name: 'دکپسول'},
	{inscode: '52455922800537930', name: 'تکنار'},
	{inscode: '52524682936687613', name: 'مبین011'},
	{inscode: '52570451223886223', name: 'ضمعا3010'},
	{inscode: '52593789542874668', name: 'پلاست'},
	{inscode: '52649373877751075', name: 'زیر9903پ01'},
	{inscode: '52699075188861283', name: 'تسه9810'},
	{inscode: '52792903131341205', name: 'افرا'},
	{inscode: '52901783912887449', name: 'ضملی2045'},
	{inscode: '52975109254504632', name: 'غمارگ'},
	{inscode: '53063537318825089', name: 'زعف9908پ06'},
	{inscode: '53113471126689455', name: 'چکارن'},
	{inscode: '53204330224889981', name: 'تبرک'},
	{inscode: '53249498382937694', name: 'فولاژح'},
	{inscode: '53251602435454519', name: 'کیان'},
	{inscode: '53386557442420539', name: 'ضخوز3011'},
	{inscode: '53419976284977130', name: 'تصمیم'},
	{inscode: '53449700212786324', name: 'مارون'},
	{inscode: '53482856220074779', name: 'غگرجیح'},
	{inscode: '53550315263430512', name: 'طخود3040'},
	{inscode: '53647874954005806', name: 'واحصا'},
	{inscode: '53686258677793038', name: 'وارس'},
	{inscode: '53892173815383358', name: 'تملی702'},
	{inscode: '53999651992586159', name: 'ثپردیس'},
	{inscode: '54042831933819763', name: 'ضمخا3028'},
	{inscode: '54210351513521239', name: 'ضخوز3000'},
	{inscode: '54211809560838833', name: 'عکاوه2'},
	{inscode: '54263829393913132', name: 'کمینا'},
	{inscode: '54277068923045214', name: 'فسرب'},
	{inscode: '54369290104873523', name: 'بتک'},
	{inscode: '54392381707226857', name: 'ضپار2010'},
	{inscode: '54419429862704331', name: 'فروس'},
	{inscode: '54424603805821073', name: 'چفیبرح'},
	{inscode: '54482686501491508', name: 'زبینا'},
	{inscode: '54509759694064219', name: 'تپکو'},
	{inscode: '54676885047867737', name: 'وتوشه'},
	{inscode: '54737885094537579', name: 'ضفلا2042'},
	{inscode: '54882843915599119', name: 'اروند07'},
	{inscode: '54995459397811265', name: 'صگل1411'},
	{inscode: '55254206302462116', name: 'آپ'},
	{inscode: '55467634116176302', name: 'ضخود3040'},
	{inscode: '55511667328361694', name: 'صخود1404'},
	{inscode: '55844260448280539', name: 'اخزا8164'},
	{inscode: '55897939403232751', name: 'لسرما'},
	{inscode: '55959112038778737', name: 'سخواف'},
	{inscode: '55963441389800122', name: 'اخزا713'},
	{inscode: '55979741213594029', name: 'کباده'},
	{inscode: '56006915451245411', name: 'لخانه'},
	{inscode: '56033738624803469', name: 'اجاد1'},
	{inscode: '56310719983603374', name: 'زعف9908پ14'},
	{inscode: '56324206651661881', name: 'فنورد'},
	{inscode: '56394387537858740', name: 'سکه0011پ02'},
	{inscode: '56429431740318486', name: 'شلرد'},
	{inscode: '56550776668133562', name: 'دفارا'},
	{inscode: '56574323121551263', name: 'شکبیر'},
	{inscode: '56591881518499520', name: 'وسین'},
	{inscode: '56717416662584054', name: 'وکادو'},
	{inscode: '56798822689379375', name: 'حاریا'},
	{inscode: '56820995669577571', name: 'قلرست'},
	{inscode: '56866372369980005', name: 'ضسان3032'},
	{inscode: '56881993417852599', name: 'تملی703'},
	{inscode: '57076944665294912', name: 'ریل1401'},
	{inscode: '57082592909752827', name: 'صایپا012'},
	{inscode: '57086055330734195', name: 'کرازی'},
	{inscode: '57139694841580593', name: 'اخزا806'},
	{inscode: '57273529732791251', name: 'خموتور'},
	{inscode: '57309221039930244', name: 'وصنعت'},
	{inscode: '57315995490037695', name: 'ضمعا3000'},
	{inscode: '57487343869808400', name: 'اجاد24'},
	{inscode: '57513265745691613', name: 'اخزا803'},
	{inscode: '57538387473389442', name: 'ضملی2040'},
	{inscode: '57551382352708199', name: 'غگز'},
	{inscode: '57639364758870873', name: 'کپشیر'},
	{inscode: '57697157542768519', name: 'ضپیک3009'},
	{inscode: '57722642338781674', name: 'پلاسک'},
	{inscode: '57761388729898548', name: 'اوصتا'},
	{inscode: '57875847776839336', name: 'فنوال'},
	{inscode: '57944184894703821', name: 'والبر'},
	{inscode: '58035444268544991', name: 'سمتاز'},
	{inscode: '58168796811562695', name: 'ضگل2032'},
	{inscode: '58180284328186631', name: 'خفناور'},
	{inscode: '58350598634599038', name: 'ضپنا3025'},
	{inscode: '58474277119959628', name: 'تملی708'},
	{inscode: '58562083282004793', name: 'زعف9908پ12'},
	{inscode: '58602432837130018', name: 'شکف'},
	{inscode: '58741071099161284', name: 'فرابورس'},
	{inscode: '58795676667458860', name: 'عسناسنگ2'},
	{inscode: '58931793851445922', name: 'ومعادن'},
	{inscode: '59142194115401696', name: 'لوتوس'},
	{inscode: '59203771713612706', name: 'رایان106'},
	{inscode: '59217041815333317', name: 'خکار'},
	{inscode: '59266699437480384', name: 'ارفع'},
	{inscode: '59342912854668427', name: 'فنفت'},
	{inscode: '59486059679335017', name: 'وپترو'},
	{inscode: '59524465288678331', name: 'پست9908-08'},
	{inscode: '59598228906194285', name: 'امید99'},
	{inscode: '59598536122397373', name: 'سخند'},
	{inscode: '59607545337891226', name: 'پرداخت'},
	{inscode: '59612098290740355', name: 'ثاباد'},
	{inscode: '59623289100408647', name: 'ضمعا3007'},
	{inscode: '59735609117437896', name: 'وبیمهح'},
	{inscode: '59800986739603675', name: 'شسم'},
	{inscode: '59839275647597021', name: 'وثوق'},
	{inscode: '59848307608894801', name: 'گپارس'},
	{inscode: '59866041653103343', name: 'نوین'},
	{inscode: '59921975187856916', name: 'غشاذر'},
	{inscode: '60061422939859083', name: 'نبروج'},
	{inscode: '60079434631497942', name: 'ورازی'},
	{inscode: '60115610575552097', name: 'تملی801'},
	{inscode: '60225663553102986', name: 'ضپار2000'},
	{inscode: '60247433951600827', name: 'شاوان'},
	{inscode: '60326793235703126', name: 'اروند08'},
	{inscode: '60350996279289099', name: 'کاوه'},
	{inscode: '60435355925269868', name: 'ضملت1118'},
	{inscode: '60451823714332895', name: 'دالبر'},
	{inscode: '60523145697836739', name: 'بورس'},
	{inscode: '60599922282667900', name: 'رایان'},
	{inscode: '60610861509165508', name: 'حکشتی'},
	{inscode: '60633055620418060', name: 'فلات'},
	{inscode: '60654872678917533', name: 'سقاین'},
	{inscode: '60783654574662426', name: 'وهنر'},
	{inscode: '60978516449331479', name: 'افاد82'},
	{inscode: '61024703979802025', name: 'اخزا817'},
	{inscode: '61056084605686893', name: 'اخزا6234'},
	{inscode: '61062392807810466', name: 'تسه9707'},
	{inscode: '61102694810476197', name: 'شپارس'},
	{inscode: '61170189647376533', name: 'اخزا814'},
	{inscode: '61218005473404311', name: 'آکورد2'},
	{inscode: '61298636307861167', name: 'وبرق'},
	{inscode: '61332057061846617', name: 'دابور'},
	{inscode: '61355897526163116', name: 'تسه9712'},
	{inscode: '61369328533907950', name: 'ضمعا3009'},
	{inscode: '61496765427212157', name: 'تهران812'},
	{inscode: '61506294208022391', name: 'غشصفا'},
	{inscode: '61506473958237003', name: 'تملی707'},
	{inscode: '61593417674315654', name: 'ضبدر2031'},
	{inscode: '61664227282090067', name: 'سلار'},
	{inscode: '61704081214633396', name: 'گندم2'},
	{inscode: '61731388465798074', name: 'کیش1402'},
	{inscode: '61743706018917484', name: 'ضسان3024'},
	{inscode: '61948819034785721', name: 'مبین014'},
	{inscode: '62001406407337461', name: 'تسه9703'},
	{inscode: '62012736978844991', name: 'دارا'},
	{inscode: '62177651435283872', name: 'شکلر'},
	{inscode: '62258804563636993', name: 'تکشا'},
	{inscode: '62280970570430885', name: 'ضجار3005'},
	{inscode: '62346804681275278', name: 'کگاز'},
	{inscode: '62419597227685987', name: 'طجار3007'},
	{inscode: '62533312115574246', name: 'ضمعا3008'},
	{inscode: '62603302940123327', name: 'ونیرو'},
	{inscode: '62664560856380150', name: 'ضپنا3022'},
	{inscode: '62786156501584862', name: 'پاکشو'},
	{inscode: '62952165421099192', name: 'بالبر'},
	{inscode: '62977319271289925', name: 'کی بی سی'},
	{inscode: '63084741752814852', name: 'دشیری'},
	{inscode: '63200220478673626', name: 'جبانک812'},
	{inscode: '63310105340116493', name: 'سخزرح'},
	{inscode: '63315013743060811', name: 'ثنور'},
	{inscode: '63363116407864462', name: 'لابسا'},
	{inscode: '63380098535169030', name: 'قنیشا'},
	{inscode: '63481599728522324', name: 'ثشاهد'},
	{inscode: '63499217872110599', name: 'کقزوی'},
	{inscode: '63580313877463104', name: 'پاسا'},
	{inscode: '63830424809501048', name: 'اپرداز'},
	{inscode: '63915926161403347', name: 'خشرق'},
	{inscode: '63917421733088077', name: 'وتجارت'},
	{inscode: '63956975483413776', name: 'عیلام3'},
	{inscode: '63985142484496935', name: 'ضملی1140'},
	{inscode: '64147416931510702', name: 'اروند06'},
	{inscode: '64155926828410021', name: 'ساذری'},
	{inscode: '64289770858657141', name: 'دقاضی'},
	{inscode: '64297895374219715', name: 'مشهد1412'},
	{inscode: '64298008532791199', name: 'ساینا'},
	{inscode: '64341992373049080', name: 'سدبیر'},
	{inscode: '64358061873294912', name: 'چفیبر'},
	{inscode: '64485827086284311', name: 'فجوش'},
	{inscode: '64699417405634265', name: 'نطرین'},
	{inscode: '64707090254488560', name: 'ثعتما'},
	{inscode: '64842837716888827', name: 'خکاوه'},
	{inscode: '64843936383937546', name: 'غگلستا'},
	{inscode: '64873834329578022', name: 'ضشنا3032'},
	{inscode: '64942549055019553', name: 'سرو'},
	{inscode: '65004959184388996', name: 'فایرا'},
	{inscode: '65023851436340574', name: 'کاردان'},
	{inscode: '65122215875355555', name: 'شفن'},
	{inscode: '65225216398254165', name: 'ضگل1136'},
	{inscode: '65235779374464744', name: 'ضمعا3001'},
	{inscode: '65321970913593427', name: 'سکرد'},
	{inscode: '65339948604901401', name: 'شستا991'},
	{inscode: '65372898104738885', name: 'کرمان00'},
	{inscode: '65413691615306869', name: 'زر2'},
	{inscode: '65414507129586385', name: 'لخزر'},
	{inscode: '65490886290565185', name: 'شزنگ'},
	{inscode: '65647223172013387', name: 'صایپا143'},
	{inscode: '65658464061006386', name: 'اخزا810'},
	{inscode: '65671173927025645', name: 'کتوکا'},
	{inscode: '65676208671737936', name: 'اخزا813'},
	{inscode: '65813520722302797', name: 'شستا0032'},
	{inscode: '65883838195688438', name: 'خودرو'},
	{inscode: '65913670626064922', name: 'تملی705'},
	{inscode: '65996297871759754', name: 'ماهان01'},
	{inscode: '65999092673039059', name: 'مداران'},
	{inscode: '66017397299787592', name: 'تسه9804'},
	{inscode: '66021783818850713', name: 'فافزا'},
	{inscode: '66036975502302203', name: 'فیروزه'},
	{inscode: '66127247173352975', name: 'تشتاد'},
	{inscode: '66142616039907394', name: 'دماوند'},
	{inscode: '66179488055896182', name: 'ضغدر2007'},
	{inscode: '66210395067138534', name: 'شتولی'},
	{inscode: '66295665969375744', name: 'سبجنو'},
	{inscode: '66362433671981035', name: 'صیدک1404'},
	{inscode: '66450490505950110', name: 'ددام'},
	{inscode: '66456062140680461', name: 'ثامان'},
	{inscode: '66514709341259550', name: 'فوکا'},
	{inscode: '66599109405217136', name: 'گکوثر'},
	{inscode: '66682662312253625', name: 'آساس'},
	{inscode: '66701874099226162', name: 'فاسمین'},
	{inscode: '66726992874614788', name: 'دتوزیع'},
	{inscode: '66772024744156373', name: 'فباهنر'},
	{inscode: '66818022341772870', name: 'اعتماد'},
	{inscode: '66830065858417081', name: 'ولانا'},
	{inscode: '67030488744129337', name: 'قپیرا'},
	{inscode: '67083516977047564', name: 'ثقزویح'},
	{inscode: '67126881188552864', name: 'رمپنا'},
	{inscode: '67170215467608124', name: 'زنگان'},
	{inscode: '67206358287598044', name: 'کهمدا'},
	{inscode: '67293053847780742', name: 'اخزا704'},
	{inscode: '67327029014085707', name: 'سخزر'},
	{inscode: '67612261115225625', name: 'تکالا'},
	{inscode: '67690708346979840', name: 'کماسه'},
	{inscode: '67744724115735698', name: 'اخزا811'},
	{inscode: '67988012428906654', name: 'دارو'},
	{inscode: '68000021842531234', name: 'صایپا998'},
	{inscode: '68117765376081366', name: 'وتوس'},
	{inscode: '68160082155090291', name: 'ضچاد3007'},
	{inscode: '68203878405672734', name: 'صنوین'},
	{inscode: '68250192165442911', name: 'اخزا818'},
	{inscode: '68368216536064894', name: 'ضغدر8024'},
	{inscode: '68488673556087148', name: 'فپنتا'},
	{inscode: '68517032834363488', name: 'شبصیر'},
	{inscode: '68635710163497089', name: 'همراه'},
	{inscode: '68703232224977945', name: 'ضشنا7054'},
	{inscode: '68846812677163892', name: 'صخود0012'},
	{inscode: '68909035712962732', name: 'ثباغ'},
	{inscode: '68994573424108746', name: 'پارتا'},
	{inscode: '69065132449283302', name: 'اطلس2'},
	{inscode: '69067576215760005', name: 'کاریس'},
	{inscode: '69090868458637360', name: 'دیران'},
	{inscode: '69128417179706303', name: 'مصفها012'},
	{inscode: '69143674941561637', name: 'پترول'},
	{inscode: '69174070929455006', name: 'حآسا2'},
	{inscode: '69340371856300801', name: 'ضفلا1147'},
	{inscode: '69399924050316081', name: 'تملی701'},
	{inscode: '69446467464337052', name: 'ضمعا3003'},
	{inscode: '69454539056549106', name: 'بشهاب'},
	{inscode: '69639854258962042', name: 'طریز3010'},
	{inscode: '69791212738327934', name: 'ضجار3000'},
	{inscode: '69842402826410870', name: 'ضترا2007'},
	{inscode: '69845771007314681', name: 'مگچسا104'},
	{inscode: '69847139870135237', name: 'اوان'},
	{inscode: '69858202392669780', name: 'تایراح'},
	{inscode: '70077718812239609', name: 'اروند09'},
	{inscode: '70199760472172539', name: 'زعف9908پ16'},
	{inscode: '70270965300262393', name: 'البرز'},
	{inscode: '70273912000644230', name: 'پست9908-02'},
	{inscode: '70289374539527245', name: 'ختوقا'},
	{inscode: '70427037538843530', name: 'صایپا203'},
	{inscode: '70474983732269112', name: 'دپارس'},
	{inscode: '70498485598181604', name: 'هرمز'},
	{inscode: '70595828753641750', name: 'پارند'},
	{inscode: '70598770338218413', name: 'ضگل2034'},
	{inscode: '70934270174405743', name: 'شخارک'},
	{inscode: '71290297158948749', name: 'زقیام'},
	{inscode: '71510396252618330', name: 'دبالک'},
	{inscode: '71516048161401340', name: 'کمند2'},
	{inscode: '71523045480231681', name: 'اعتماد4'},
	{inscode: '71523986304961239', name: 'قشیر'},
	{inscode: '71577346467108601', name: 'کورش99'},
	{inscode: '71666521540545716', name: 'غبهار'},
	{inscode: '71672399601682259', name: 'ثروتم'},
	{inscode: '71744682148776880', name: 'ولصنم'},
	{inscode: '71750273350404502', name: 'ضسان3033'},
	{inscode: '71772000724177515', name: 'اخزا706'},
	{inscode: '71856634742001725', name: 'سپ'},
	{inscode: '71901111301490182', name: 'اخزا718'},
	{inscode: '71957984642204570', name: 'شپترو'},
];
//start

typicalHeader = {
	Accept: '*/*',
	'Accept-Encoding': 'gzip, deflate',
	'Accept-Language': 'en-GB,en;q=0.9,fa-IR;q=0.8,fa;q=0.7,en-US;q=0.6,ar;q=0.5,sd;q=0.4',
	Connection: 'keep-alive',
	Host: 'www.tsetmc.com',
	Referer: 'http://www.tsetmc.com/Loader.aspx?ParTree=15131F',
	'User-Agent':
		'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/80.0.3987.87 Safari/537.36',
};
let out = '';
const axios = require('axios');

(ctSendCntr = 0), (ctRecvCntr = 0);
pClosingSendCntr = 0;
pClosingRecvCntr = 0;
bodySendCntr = 0;
bodyRecvCntr = 0;
histError = 0;
intraDaySendCntr = 0;
intraDayRecvCntr = 0;
marketInitRecvCntr = 0;
clientTypeAllSendCntr = 0;
clientTypeAllRecvCntr = 0;

let globalCntr = 0;

//var file = fs.createWriteStream('init.txt');
//var file1 = fs.createWriteStream('allrows.txt');
let successCntr = 0;
let insertedCntr = 0;
let errorCntr = 0;
let testCntr = 0;

function GetDate() {
	let date = new Date().toLocaleTimeString('fa-IR', {
		hour: '2-digit',
		minute: '2-digit',
		second: '2-digit',
	});

	hour = date.split(':')[0];
	min = date.split(':')[1];
	sec = date.split(':')[2];

	let d = jalaali.toJalaali(new Date());
	year = d.jy;
	mon = d.jm;
	day = d.jd;
	out = {year: year, mon: mon, day: day, hour: hour, min: min, sec: sec};

	return out;
}

function GetMarketInit(dbo, id) {
	return new Promise(async (res, rej) => {
		let url = 'http://www.tsetmc.com/tsev2/data/MarketWatchInit.aspx?h=0&r=0';
		let error = 1;

		date = GetDate();
		axios
			.get(url, {
				headers: typicalHeader,
			})
			.then(async response => {
				marketInitSendCntr = response.data.split(';').length - 1;
				console.log('marketInitSendCntr = ', marketInitSendCntr);
				marketInitRecvCntr = 0;
				response.data.split(';').map(async (v, i) => {
					successCntr++;
					t = v.split(',');
					if (i == 0) {
						miDate = t[2].replace(/.*@/, '');
						miDate = miDate.replace(/ .*/, '');
						console.log('miDate = ', miDate);
					}
					if (t[1].match(/^IR/)) {
						let inscode = t[0];
						let l18 = t[2];
						let l30 = t[3];
						let pc = t[6];
						let pl = t[7];
						let tvol = t[9];
						let pmin = t[11];
						let pmax = t[12];
						let tmed = t[13];
						let eps = t[14];
						let flow = t[17];
						let cs = t[18];
						let tmax = t[19];
						let tmin = t[20];
						let pe = Math.round((Number(pc) / Number(eps)) * 100) / 100;
						let pcp = ((pc - tmed) / tmed) * 100;
						let plp = ((pl - tmed) / tmed) * 100;
						let name = l18
							.toString()
							.replace('ي', 'ی')
							.replace('ي', 'ی')
							.replace('ي', 'ی')
							.replace('ك', 'ک')
							.replace('ك', 'ک')
							.replace('ك', 'ک');
						let fullName = l30
							.toString()
							.replace('ي', 'ی')
							.replace('ي', 'ی')
							.replace('ي', 'ی')
							.replace('ك', 'ک')
							.replace('ك', 'ک')
							.replace('ك', 'ک');

						//index = symbols.findIndex(v1 => (v1.name = name));

						await dbo.collection('mi').updateOne(
							{name: name},
							{
								$set: {
									fullName,
									pl: pl,
									tmin: tmin,
									tmax: tmax,
									tmed: tmed,
									tvol: tvol,
									pmax,
									pmin,
									pc: pc,
									l18: l18,
									inscode: inscode,
									id: id,
									pe: pe,
									esp: eps,
									pcp,
									plp,
									cs,
									flow,
									date: miDate,
								},
							},
						);

						await dbo.collection('allRows').updateOne(
							{name: name},
							{
								$set: {
									fullName,
									pl: pl,
									tmin: tmin,
									tmax: tmax,
									tmed: tmed,
									tvol: tvol,
									pmax,
									pmin,
									pc: pc,
									l18: l18,
									inscode: inscode,
									id: id,
									pe: pe,
									esp: eps,
									pcp,
									plp,
									cs,
									flow,
									date: miDate,
								},
							},
						);

						marketInitRecvCntr++;
						//   console.log('marketInitRecvCntr = ', marketInitRecvCntr);
						if (marketInitRecvCntr == marketInitSendCntr) {
							marketInitDone = 1;
							console.log('marketInitDone');
							res(1);
						}
					} else {
						inscode = t[0];
						//index = symbols.findIndex(v1 => (v1.inscode = inscode));

						if (t[1] == 1) {
							qo1 = t[4]; //gh kharid
							po1 = t[5]; //gh forush

							qd1 = t[6]; //hajm kharid
							pd1 = t[7]; //hajm forush

							await dbo.collection('mi').updateOne(
								{inscode: inscode},
								{
									$set: {
										qo1: qo1, //gh kharid
										po1: po1, //gh forush
										qd1: qd1, //hajm kharid
										pd1: pd1, //hajm forush
									},
								},
							);

							await dbo.collection('allRows').updateOne(
								{inscode: inscode},
								{
									$set: {
										qo1: qo1, //gh kharid
										po1: po1, //gh forush
										qd1: qd1, //hajm kharid
										pd1: pd1, //hajm forush
									},
								},
							);

							marketInitRecvCntr++;
							console.log('marketInitRecvCntr = ', marketInitRecvCntr);
							if (marketInitRecvCntr == marketInitSendCntr) {
								console.log('marketInitDone');
								marketInitDone = 1;
								res(1);
							}
						} else if (t[1] == 2) {
							qo2 = t[5]; //gh kharid
							po2 = t[6]; //gh forush

							qd2 = t[7]; //hajm kharid
							pd2 = t[8]; //hajm forush

							await dbo.collection('mi').updateOne(
								{inscode: inscode},
								{
									$set: {
										qo2: qo2, //gh kharid
										po2: po2, //gh forush
										qd2: qd2, //hajm kharid
										pd2: pd2, //hajm forush
									},
								},
							);

							await dbo.collection('allRows').updateOne(
								{inscode: inscode},
								{
									$set: {
										qo2: qo2, //gh kharid
										po2: po2, //gh forush
										qd2: qd2, //hajm kharid
										pd2: pd2, //hajm forush
									},
								},
							);
							marketInitRecvCntr++;
							console.log('marketInitRecvCntr = ', marketInitRecvCntr);
							if (marketInitRecvCntr == marketInitSendCntr) {
								console.log('marketInitDone');
								marketInitDone = 1;
								res(1);
							}
						} else if (t[1] == 3) {
							qo3 = t[5]; //gh kharid
							po3 = t[6]; //gh forush

							qd3 = t[7]; //hajm kharid
							pd3 = t[8]; //hajm forush

							qo3 = qo3; //gh kharid
							po3 = po3; //gh forush
							qd3 = qd3; //hajm kharid
							pd3 = pd3; //hajm forush

							await dbo.collection('mi').updateOne(
								{inscode: inscode},
								{
									$set: {
										qo3: qo3, //gh kharid
										po3: po3, //gh forush
										qd3: qd3, //hajm kharid
										pd3: pd3, //hajm forush
									},
								},
							);

							await dbo.collection('allRows').updateOne(
								{inscode: inscode},
								{
									$set: {
										qo3: qo3, //gh kharid
										po3: po3, //gh forush
										qd3: qd3, //hajm kharid
										pd3: pd3, //hajm forush
									},
								},
							);

							marketInitRecvCntr++;
							console.log('marketInitRecvCntr = ', marketInitRecvCntr);
							if (marketInitRecvCntr == marketInitSendCntr) {
								console.log('marketInitDone');
								marketInitDone = 1;
								res(1);
							}
						}
					}
				});

				//res(1);
			})
			.catch(error => {
				if (error.code) console.log('errorMarketInit = ', error.code);
				else {
					console.log('error = ', error);
				}
				marketInitRecvCntr++;
				console.log('marketInitRecvCntr = ', marketInitRecvCntr);
				if (marketInitRecvCntr == marketInitSendCntr) {
					console.log('marketInitDone');
					marketInitDone = 1;
					res(1);
				}
				marketInitDone = 0;
				errorCntr++;
			});
	});
}

function GetParTree(id) {
	return new Promise(async (res, rej) => {
		let url = 'http://www.tsetmc.com/Loader.aspx?ParTree=15';
		let error = 1;
		date = GetDate();
		axios
			.get(url, {
				headers: typicalHeader,
			})
			.then(async response => {
				let str = response.data;
				let reg = /<td>ارزش معاملات<\/td>([^<]+?).*?title="(.*?)"/g;

				match = reg.exec(str);
				arzeshBourse = Number(match[2].replace(/,/g, ''));
				console.log('arzeshBourse = ', arzeshBourse);
				match = reg.exec(str);
				arzeshFara = Number(match[2].replace(/,/g, ''));
				console.log('arzeshFara = ', arzeshFara);
				parTreeDone = 1;
				await dbo.collection('allRows').insertOne({
					_id: 'bazar',
					arzeshBourse: arzeshBourse,
					arzeshFara: arzeshFara,
				});
				res(1);
			})
			.catch(error => {
				console.log('parTree error = ', error.code);
				parTreeDoneDone = 0;
				errorCntr++;
				res(1);
			});
	});
}

function GetClientTypeAll(dbo, id) {
	return new Promise(async (res, rej) => {
		let url = 'http://www.tsetmc.com/tsev2/data/ClientTypeAll.aspx';
		let error = 1;
		date = GetDate();
		axios
			.get(url, {
				headers: typicalHeader,
			})
			.then(async response => {
				response.data.split(';').map(async (v, i) => {
					clientTypeAllSendCntr++;
					//console.log('clientTypeAllSendCntr = ', clientTypeAllSendCntr);
					//clientTypeAllDone = 1;
					clientTypeAllDone = 0;
					t = v.split(',');
					let inscode = t[0];
					let cntr = 1;
					let Buy_CountI = t[cntr++];
					let Buy_CountN = t[cntr++];
					let Buy_I_Volume = t[cntr++];
					let Buy_N_Volume = t[cntr++];

					let Sell_CountI = t[cntr++];
					let Sell_CountN = t[cntr++];
					let Sell_I_Volume = t[cntr++];
					let Sell_N_Volume = t[cntr++];

					if (inscode == '24079409192818584') {
						console.log('Sell_I_Volume = ', Sell_I_Volume);
					}
					await dbo.collection('mi').updateOne(
						{inscode: inscode},
						{
							$set: {
								Buy_CountI,
								Buy_CountN,
								Buy_I_Volume,
								Buy_N_Volume,

								Sell_CountI,
								Sell_CountN,
								Sell_I_Volume,
								Sell_N_Volume,
							},
						},
					);

					if (inscode == '24079409192818584') {
						console.log('Sell_I_Volume = ', Sell_I_Volume);
					}
					//console.log("inscode = ", inscode);
					await dbo.collection('allRows').updateOne(
						{inscode: inscode},
						{
							$set: {
								Buy_CountI,
								Buy_CountN,
								Buy_I_Volume,
								Buy_N_Volume,

								Sell_CountI,
								Sell_CountN,
								Sell_I_Volume,
								Sell_N_Volume,
							},
						},
					);

					clientTypeAllRecvCntr++;
					console.log('clientTypeAllRecvCntr = ', clientTypeAllRecvCntr);
					if (clientTypeAllSendCntr == clientTypeAllRecvCntr) {
						res(1);
						clientTypeAllDone = 1;
					}
				});
			})
			.catch(error => {
				console.log('error = ', error.code);
				clientTypeAllRecvCntr++;
				if (clientTypeAllSendCntr == clientTypeAllRecvCntr) {
					res(1);
					clientTypeAllDone = 1;
				}
				//clientTypeAllDone = 0;
				console.log('ClientTypeAllDone = ', clientTypeAllDone);
				errorCntr++;
				//res(1);
			});
	});
}

clientTypeHistCalls = [];
function GetClientTypeHist(dbo, id) {
	return new Promise((res, rej) => {
		setTimeout(() => {
			console.log('f3');
			console.log('ctSendCntr = ', ctSendCntr);
			console.log('ctRecvCntr = ', ctRecvCntr);
			res(1);
		}, 60000);

		instAll.forEach(async (v, i) => {
			let ind = allRows.findIndex((v1, i1) => v1.name == v.name);
			if (v.name.match(/^([^0-9]*)$/) && !allRows[ind].ctHist) {
				url = 'http://tsetmc.com/tsev2/data/clienttype.aspx?i=' + v.inscode;
				clientTypeHistCalls[ctSendCntr] = axios.CancelToken.source();
				//console.log('ctSendCntr = ', ctSendCntr);
				axios
					.get(url, {cancelToken: clientTypeHistCalls[ctSendCntr].token})
					.then(async response => {
						ctHist = response.data.split(';').map(v => v.split(','));
						ctHist.forEach((v, i) => {
							v.forEach((v1, i1) => {
								ctHist[i][i1] = Number(v1);
							});
						});
						ctHist = ctHist.slice(0, 30);
						allRows[ind].ctHist = ctHist;

						await dbo.collection('allRows').updateOne({name: v.name}, {$set: {ctHist: ctHist}});

						ctRecvCntr++;
						console.log('ctOk = ', ctRecvCntr);

						if (ctRecvCntr == ctSendCntr) {
							res(1);
						}
					})
					.catch(error => {
						if (error.code == 'Z_BUF_ERROR') {
							allRows[ind].ctHist = [];
						}
						ctRecvCntr++;
						console.log('ctError = ', error.code);
						if (ctRecvCntr == ctSendCntr) {
							res(1);
						}
					});
				ctSendCntr++;
			} else {
				//console.log('histExist = ', i);
			}
		});
		if (ctSendCntr == ctRecvCntr) {
			console.log('clientTypeHist already Done');
			res(1);
		}
	});
}

async function GetBodyValues(body, v, dbo) {
	return new Promise(async (res, rej) => {
		var regex = /LVal18AFC='(.*?)',D/g;
		match = regex.exec(body);
		try {
			let name = match[1];

			var regex = /,KAjCapValCpsIdx='(.*?)',P/g;
			cntr = 0;
			match = regex.exec(body);
			floatVal = match[1];
			let ind = allRows.findIndex((v1, i1) => v1.name == v.name);

			//var ma = /بازار پايه زرد فرابورس/g;
			//bodies = body.split('<!doctype html>');
			//var file = fs.createWriteStream('color.txt');
			//allRows.forEach((v, i) => {
			//  bd = bodies.find((v1, i1) => v1.match("InsCode='" + v.inscode));
			//  //v.body = bd;
			//  v.color = 'y';
			//  //if (v.body.match(ma)) {
			//  //	file.write(v.l18 + '\n');
			//  //}
			//});

			var regex = /,ZTitad=(.*?),CI/g;
			cntr = 0;
			match = regex.exec(body);
			let totalVol = match[1];

			var regex = /,InsCode='(.*?)',B/g;
			match = regex.exec(body);
			let insCode = match[1];

			var regex = /,SectorPE='(.*?)',KAjC/g;
			match = regex.exec(body);
			let sectorPE = match[1];

			var regex = /LSecVal='(.*?)',Cg/g;
			match = regex.exec(body);
			let csName = match[1];

			var regex = /QTotTran5JAvg='(.*?)',SectorPE/g;
			match = regex.exec(body);
			let QTotTran5JAvg = match[1];

			var regex = /,Title='.*',Fa/g;
			match = regex.exec(body);
			if (match[0].match('زرد')) {
				color = 'yellow';
			} else if (match[0].match('قرمز')) {
				color = 'red';
			} else if (match[0].match('نارنج')) {
				color = 'orange';
			} else {
				color = 'black';
			}

			await dbo.collection('mi').updateOne(
				{name: v.name},
				{
					$set: {
						floatVal: floatVal,
						totalVol: totalVol,
						sectorPE: sectorPE,
						csName: csName,
						QTotTran5JAvg: QTotTran5JAvg,
						color: color,
						body: 1,
					},
				},
			);

			await dbo.collection('allRows').updateOne(
				{name: v.name},
				{
					$set: {
						floatVal: floatVal,
						totalVol: totalVol,
						sectorPE: sectorPE,
						csName: csName,
						QTotTran5JAvg: QTotTran5JAvg,
						color: color,
						body: 1,
					},
				},
			);
			res(1);
		} catch (e) {
			console.log('catch bodyError = ', e);
			res(1);
		}
	});
}

bodyCalls = [];
function GetBody(dbo, id) {
	return new Promise(async (res, rej) => {
		setTimeout(() => {
			console.log('bodySendCntr = ', bodySendCntr);
			console.log('bodyRecvCntr = ', bodyRecvCntr);
			res(1);
		}, 60000);

		instAll.forEach((v, i) => {
			let ind = allRows.findIndex((v1, i1) => v1.name == v.name);
			if (v.name.match(/^([^0-9]*)$/) && allRows[ind].body != 1) {
				url = 'http://tsetmc.com//loader.aspx?ParTree=151311&i=' + v.inscode;
				bodyCalls[bodySendCntr] = axios.CancelToken.source();
				axios
					.get(url, {cancelToken: bodyCalls[bodySendCntr].token})
					.then(async response => {
						allRows[ind].body = 1;
						await GetBodyValues(response.data, v, dbo);
						bodyRecvCntr++;
						console.log('bodyOk = ', bodyRecvCntr);
						if (bodyRecvCntr == bodySendCntr) {
							console.log('bodySendCntr = ', bodySendCntr);
							console.log('bodyRecvCntr = ', bodyRecvCntr);
							res(1);
						}
					})

					.catch(err => {
						bodyRecvCntr++;
						if (bodyRecvCntr == bodySendCntr) {
							console.log('bodySendCntr = ', bodySendCntr);
							console.log('bodyRecvCntr = ', bodyRecvCntr);
							res(1);
						}
						console.log('bodyError = ', err.code);
					});
				bodySendCntr++;
			}
		});
		if (bodySendCntr == bodyRecvCntr) {
			console.log('body already Done');
			res(1);
		}
	});
}

pClosingHistCalls = [];

function GetPClosingHist1Day(day, inscode) {
	return new Promise(async (res, rej) => {
		setTimeout(() => {
			console.log('pClosingSendCntr = ', pClosingSendCntr);
			console.log('pClosingRecvCntr = ', pClosingRecvCntr);
			res(1);
		}, 60000);

		instAll.forEach(async (v, i) => {
			let ind = allRows.findIndex((v1, i1) => v1.name == v.name);
			if (ind != -1) {
				//        console.log("v = ", v);
				if (v.name.match(/^([^0-9]*)$/) && !allRows[ind].pClosingHist) {
					let url = 'http://cdn.tsetmc.com/Loader.aspx?ParTree=15131P&i=' + v.inscode + '&d=' + day; //20200223
					pClosingHist1DayCalls[pClosingSendCntr] = axios.CancelToken.source();
					axios
						.get(url, {
							cancelToken: pClosingHist1DayCalls[pClosingSendCntr].token,
						})
						.then(response => {
							pClosingHist1DayRecvCntr++;
							console.log('pclosing1DayOk = ', pClosingHist1DayRecvCntr);
							if (pClosingHist1DayRecvCntr == pClosingHist1DaySendCntr) {
								console.log('pClosing1DaySendCntr = ', pClosingHist1DaySendCntr);
								console.log('pClosing1DayRecvCntr = ', pClosingHist1DayRecvCntr);
								res(1);
							}

							hist = response.data
								.split(';')
								.map(v => v.split(','))
								.map(v => ({
									date: v[0],
									vol: Number(v[5]),
									pl: Number(v[6]),
								}));

							allRows[ind].hist = hist;

							var row = dbo.collection('allRows').updateOne({name: v.name}, {$set: {hist: hist}});
						})
						.catch(error => {
							pClosingRecvCntr++;
							console.log('pclosingError = ', error.code);
							if (pClosingRecvCntr == pClosingSendCntr) {
								console.log('pClosingSendCntr = ', pClosingSendCntr);
								console.log('pClosingRecvCntr = ', pClosingRecvCntr);
								res(1);
							}
						});
					pClosingSendCntr++;
				}
			}
		});

		if (pClosingSendCntr == pClosingRecvCntr) {
			console.log('pClosingHist already Done');
			res(1);
		}
	});
}

intraDayPriceCalls = [];
intraDayBuffer = [];
function GetIntraDayPrice(day, inscode) {
	return new Promise(async (res, rej) => {
		setTimeout(() => {
			console.log('intraDaySendCntr = ', intraDaySendCntr);
			console.log('intraDayRecvCntr = ', intraDayRecvCntr);
			res(1);
		}, 120000);

		instAll.forEach(async (v, i) => {
			let ind = allRows.findIndex((v1, i1) => v1.name == v.name);
			if (ind != -1) {
				if (v.name.match(/^([^0-9]*)$/) && !allRows[ind].intraDayPrice) {
					let url = 'http://www.tsetmc.com/tsev2/chart/data/IntraDayPrice.aspx?i=' + v.inscode;
					intraDayPriceCalls[intraDaySendCntr] = axios.CancelToken.source();
					axios
						.get(url, {cancelToken: intraDayPriceCalls[intraDaySendCntr].token})
						.then(async response => {
							if (intraDayRecvCntr == intraDaySendCntr) {
								console.log('intraDaySendCntr = ', intraDaySendCntr);
								console.log('intraDayRecvCntr = ', intraDayRecvCntr);
								res(1);
							}

							intraDayPrice = response.data
								.split(';')
								.map(v => v.split(','))
								.map(v => ({
									date: v[0],
									pl: Number(v[4]),
									vol: Number(v[5]),
								}));

							allRows[ind].intraDayPrice = intraDayPrice;
							var row = await dbo
								.collection('allRows')
								.updateOne({name: v.name}, {$set: {intraDayPrice: intraDayPrice}});

							intraDayRecvCntr++;
							console.log('intraDayOk = ', intraDayRecvCntr);
						})
						.catch(error => {
							intraDayRecvCntr++;
							console.log('intraDayError = ', error.code);
							//file1.write(v.name + '\n');
							if (error.code == 'Z_BUF_ERROR') {
								allRows[ind].intraDayPrice = [];
							}
							if (intraDayRecvCntr == intraDaySendCntr) {
								console.log('intraDaySendCntr = ', intraDaySendCntr);
								console.log('intraDayRecvCntr = ', intraDayRecvCntr);
								res(1);
							}
						});
					intraDaySendCntr++;
				}
			}
		});

		if (intraDaySendCntr == intraDayRecvCntr) {
			console.log('intraDay already Done');
			res(1);
		}
	});
}

function GetPClosingHist(dbo, id, a) {
	return new Promise(async (res, rej) => {
		setTimeout(() => {
			console.log('pClosingSendCntr = ', pClosingSendCntr);
			console.log('pClosingRecvCntr = ', pClosingRecvCntr);
			res(1);
		}, 60000);

		instAll.forEach(async (v, i) => {
			let ind = allRows.findIndex((v1, i1) => v1.name == v.name);
			if (ind != -1) {
				//        console.log("v = ", v);
				let flag = a == 1 ? !allRows[ind].hist : !allRows[ind].histNotAdj;
				if (v.name.match(/^([^0-9]*)$/) && flag) {
					url = 'http://tsetmc.com/tsev2/chart/data/Financial.aspx?i=' + v.inscode + '&t=ph&a=' + a;
					pClosingHistCalls[pClosingSendCntr] = axios.CancelToken.source();
					axios
						.get(url, {cancelToken: pClosingHistCalls[pClosingSendCntr].token})
						.then(async response => {
							if (pClosingRecvCntr == pClosingSendCntr) {
								console.log('pClosingSendCntr = ', pClosingSendCntr);
								console.log('pClosingRecvCntr = ', pClosingRecvCntr);
								res(1);
							}

							hist = response.data
								.split(';')
								.map(v => v.split(','))
								.map(v => ({
									date: v[0],
									vol: Number(v[5]),
									pl: Number(v[6]),
								}));

							//hist = [{
							//  date: "20200103",
							//  vol: Number(10),
							//  pl: Number(10),
							//}]

							if (a == 1) {
								allRows[ind].hist = hist;
                                let max = Match.max(...hist);

								var row = await dbo
									.collection('allRows')
									.updateOne({name: v.name}, {$set: {hist: hist}});
							} else {
								hist = hist.map(v => v.pl);
								allRows[ind].histNotAdj = hist;
								var row = await dbo
									.collection('allRows')
									.updateOne({name: v.name}, {$set: {histNotAdj: hist}});
							}
							pClosingRecvCntr++;
							console.log('pclosingOk = ', pClosingRecvCntr);
						})
						.catch(error => {
							pClosingRecvCntr++;
							if (error.code) console.log('pclosingError = ', error.code);
							else console.log('pclosingError = ', error);

							if (error.code == 'Z_BUF_ERROR') {
								a == 1 ? (allRows[ind].hist = []) : (allRows[ind].histNotAdj = []);
							}
							if (pClosingRecvCntr == pClosingSendCntr) {
								console.log('pClosingSendCntr = ', pClosingSendCntr);
								console.log('pClosingRecvCntr = ', pClosingRecvCntr);
								res(1);
							}
						});
					pClosingSendCntr++;
				}
			}
		});

		if (pClosingSendCntr == pClosingRecvCntr) {
			console.log('pClosingHist already Done');
			res(1);
		}
	});
}

function GetPClosing() {
	globalCntr++;
	//out = '';
	out += globalCntr.toString() + ',';
	instAll
		.filter((v, i) => i < 100000)
		.forEach((v, i) => {
			let urll = 'http://www.tsetmc.com/tsev2/data/instinfodata.aspx?i=' + v.inscode + '&c=44+';
			//console.log('urll = ', urll);
			axios
				.get(urll, {name: 'tese'}, {timeout: 1000})
				.then(response => {
					let pClosing = response.data.split(';')[0].split(',')[2];

					t = allRows.findIndex(v1 => v1.inscode == v.inscode);

					v.name == 'شیراز' ? console.log('pClosing = ', pClosing) : null;
					t == -1
						? (allRows.push({pl: pClosing, inscode: v.inscode, name: v.name}), console.log(pClosing))
						: null;
				})
				.catch(error => {
					out += error;
					console.log('error = ', error);
				});
		});
}

async function InitDbAndAllRows(dbo) {
	return new Promise(async (res, rej) => {
		allRows = [];

		if (cl == 1) {
			try {
				dbo.collection('allRows').remove({});
				dbo.collection('mi').remove({});
			} catch (e) {
				console.log('e = ', e);
			}
		}

		await dbo.createCollection('allRows');
		await dbo.createCollection('mi');

		instAll.forEach(async (v, i) => {
			allRows.push({inscode: v.inscode, name: v.name});
			row = await dbo
				.collection('allRows')
				.find({name: v.name})
				.toArray();
			if (!row.length) {
				await dbo.collection('allRows').insertOne(v);
			}
		});

		instAll.forEach(async (v, i) => {
			allRows.push({inscode: v.inscode, name: v.name});
			row = await dbo
				.collection('mi')
				.find({name: v.name})
				.toArray();
			if (!row.length) {
				await dbo.collection('mi').insertOne(v);
			}
		});

		//await dbo.collection('allRows').insertMany({allRows});
		console.log('init db finished');
		res(1);
	});
}

async function ConnectToDB() {
	return new Promise((res, rej) => {
		MongoClient.connect(mongoUrl, async (err, clt) => {
			console.log('err = ', err);
			dbo = await clt.db('filterbo_database');
			console.log('dbo = ');
			client = clt;
			res(1);
		});
	});
}

function GetShakesHa() {
	GetKhodro();
}

function GetKhodro() {
	let date = [],
		value = [];
	url = 'http://www.tsetmc.com/tsev2/chart/data/Index.aspx?i=20213770409093165&t=value';
	axios
		.get(url, {
			headers: typicalHeader,
		})
		.then(response => {
			response.data.split(';').map((v, i) => {
				t = v.split(',');
				date[i] = t[0];
				value[i] = t[1];
			});
		});
}
//const express = require('express')
//const app = express()
//const port = 30124
//
//app.get('/', (req, res) => res.send('Hello World!'))
//
//app.listen(port, () => console.log(`Example app listening on port ${port}!`))
